test/load-test.yaml
config:
  target: "https://immense-anchorage-61325.herokuapp.com"
  engine: "socketio"
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - name: "Connect and Add Users"
    flow:
    - emit:
        channel: "add_user"
        data: "jack"
    - think: 1
  - name: "Game Ready to Play"
    flow:
      - emit:
          channel: "ready"
      - think: 1