test/socketio-load-test.yaml
config:
  target: "https://immense-anchorage-61325.herokuapp.com"
  engine: "socketio"
  phases:
    - duration: 1
      arrivalRate: 50
scenarios:
  # - name: "Connect and Add Users"
  #   flow:
  #     - emit:
  #         channel: "add_user"
  #         data: "jack"
  #     - think: 1
  # - name: "Game Ready to Play"
  #   flow:
  #     - emit:
  #         channel: "ready"
  #     - think: 1
  # - name: "Move Blocks"
  #   flow:
  #     - emit:
  #         channel: "move"
  #         data: "up"
  #     - think: 1
  # - name: "Log Play Again Request"
  #   flow:
  #     - emit:
  #         channel: "game_again"
  #         data: true
  #     - think: 1
  - name: "Upload Survey to MongoDB"
    flow:
      - emit:
          channel: "survey"
          data: ["Yes", "Rating 5"]
      - think: 1